In [147]:
import numpy as np
import pandas as pd

## Shipment

### Florida -- AZ, LA, SC

In [231]:
url = 'https://raw.githubusercontent.com/MIDS-at-Duke/pds-2022-yellow-team/main/20_intermediate_files/fl_ship_merge.csv?token=GHSAT0AAAAAABYIEB2PFL555SBGBNVDARLGY4TWU3A'
df = pd.read_csv(url)
df.head(5)

,STNAME,CTYNAME,YEAR,POPULATION,BUYER_COUNTY_x,BUYER_STATE_x,FIPS Code,State_x,BUYER_STATE_y,BUYER_COUNTY_y,MME,State_y
0,Arizona,APACHE,2006,69066,APACHE,AZ,4001,Arizona,AZ,APACHE,4.956969e+06,Arizona
1,Arizona,APACHE,2007,69278,APACHE,AZ,4001,Arizona,AZ,APACHE,5.611684e+06,Arizona
2,Arizona,APACHE,2008,69520,APACHE,AZ,4001,Arizona,AZ,APACHE,5.853244e+06,Arizona
3,Arizona,APACHE,2009,70591,APACHE,AZ,4001,Arizona,AZ,APACHE,7.344332e+06,Arizona
4,Arizona,APACHE,2010,71828,APACHE,AZ,4001,Arizona,AZ,APACHE,7.732743e+06,Arizona

In [233]:
df1 = df.copy()
df1['BUYER_STATE_x']=df['BUYER_STATE_x'].replace(['AZ','LA','SC'],'Comparison_State')

In [234]:
df1

,STNAME,CTYNAME,YEAR,POPULATION,BUYER_COUNTY_x,BUYER_STATE_x,FIPS Code,State_x,BUYER_STATE_y,BUYER_COUNTY_y,MME,State_y
0,Arizona,APACHE,2006,69066,APACHE,Comparison_State,4001,Arizona,AZ,APACHE,4.956969e+06,Arizona
1,Arizona,APACHE,2007,69278,APACHE,Comparison_State,4001,Arizona,AZ,APACHE,5.611684e+06,Arizona
2,Arizona,APACHE,2008,69520,APACHE,Comparison_State,4001,Arizona,AZ,APACHE,5.853244e+06,Arizona
3,Arizona,APACHE,2009,70591,APACHE,Comparison_State,4001,Arizona,AZ,APACHE,7.344332e+06,Arizona
4,Arizona,APACHE,2010,71828,APACHE,Comparison_State,4001,Arizona,AZ,APACHE,7.732743e+06,Arizona
...,...,...,...,...,...,...,...,...,...,...,...,...
1715,South Carolina,YORK,2010,226871,YORK,Comparison_State,45091,South Carolina,SC,YORK,5.209517e+07,South Carolina
1716,South Carolina,YORK,2011,230131,YORK,Comparison_State,45091,South Carolina,SC,YORK,5.296504e+07,South Carolina
1717,South Carolina,YORK,2012,234151,YORK,Comparison_State,45091,South Carolina,SC,YORK,5.644417e+07,South Carolina
1718,South Carolina,YORK,2013,238736,YORK,Comparison_State,45091,South Carolina,SC,YORK,5.813704e+07,South Carolina
1719,South Carolina,YORK,2014,244661,YORK,Comparison_State,45091,South Carolina,SC,YORK,6.217813e+07,South Carolina

In [235]:
df1['BUYER_STATE_x'].value_counts()
round(df1.groupby('BUYER_STATE_x')['MME'].describe(),2)

,count,mean,std,min,25%,50%,75%,max
BUYER_STATE_x,,,,,,,,
Comparison_State,1120.0,5.532070e+07,1.723070e+08,2185.88,4985211.97,14981229.21,4.354434e+07,2.114214e+09
FL,600.0,1.724027e+08,3.462363e+08,628449.83,9807154.29,54206960.72,1.665996e+08,3.026737e+09

In [236]:
# fl shipment to Arizona before 2010
fl_ship_az = df[df['STNAME'] == 'Arizona']
fl_ship_az1 = fl_ship_az[fl_ship_az['YEAR']<= 2010]
fl_ship_az1.groupby('STNAME')['MME'].mean()

STNAME
Arizona    1.644573e+08
Name: MME, dtype: float64

In [237]:
# fl shipment to Arizona after 2010
fl_ship_az2 = fl_ship_az[fl_ship_az['YEAR']> 2010]
fl_ship_az2.groupby('STNAME')['MME'].mean()

STNAME
Arizona    2.353518e+08
Name: MME, dtype: float64

In [238]:
# shipment to Arizona by CTYNAME before 2010
fl_ship_az1.groupby('CTYNAME')['MME'].mean()
fl_ship_az1.max()

STNAME                      Arizona
CTYNAME                        YUMA
YEAR                           2010
POPULATION                  4023132
BUYER_COUNTY_x                 YUMA
BUYER_STATE_x                    AZ
FIPS Code                      4027
State_x                     Arizona
BUYER_STATE_y                    AZ
BUYER_COUNTY_y                 YUMA
MME               1784577100.201575
State_y                     Arizona
dtype: object

In [239]:
# shipment to Arizona by CTYNAME after 2010
fl_ship_az2.groupby('CTYNAME')['MME'].mean()
fl_ship_az2.max()

STNAME                      Arizona
CTYNAME                        YUMA
YEAR                           2014
POPULATION                  4094842
BUYER_COUNTY_x                 YUMA
BUYER_STATE_x                    AZ
FIPS Code                      4027
State_x                     Arizona
BUYER_STATE_y                    AZ
BUYER_COUNTY_y                 YUMA
MME               2114214074.404012
State_y                     Arizona
dtype: object

In [240]:
# fl shipment to Louisiana before 2010
fl_ship_la = df[df['STNAME'] == 'Louisiana']
fl_ship_la1 = fl_ship_la[fl_ship_la['YEAR']<= 2010]
fl_ship_la1.groupby('STNAME')['MME'].mean()

STNAME
Louisiana    2.719488e+07
Name: MME, dtype: float64

In [241]:
# fl shipment to Louisiana after 2010
fl_ship_la2 = fl_ship_la[fl_ship_la['YEAR']> 2010]
fl_ship_la2.groupby('STNAME')['MME'].mean()

STNAME
Louisiana    3.126748e+07
Name: MME, dtype: float64

In [242]:
# fl shipment to South Carolina before 2010
fl_ship_sc = df[df['STNAME'] == 'South Carolina']
fl_ship_sc1 = fl_ship_sc[fl_ship_sc['YEAR']<= 2010]
fl_ship_sc1.groupby('STNAME')['MME'].mean()

STNAME
South Carolina    3.766200e+07
Name: MME, dtype: float64

In [243]:
# fl shipment to South Carolina after 2010
fl_ship_sc2 = fl_ship_sc[fl_ship_sc['YEAR']> 2010]
fl_ship_sc2.groupby('STNAME')['MME'].mean()

STNAME
South Carolina    5.581880e+07
Name: MME, dtype: float64

In [244]:
# fl shipment to Florida before 2010
fl_ship_fl = df[df['STNAME'] == 'Florida']
fl_ship_fl1 = fl_ship_fl[fl_ship_fl['YEAR']<= 2010]
fl_ship_fl1.groupby('STNAME')['MME'].mean()

STNAME
Florida    1.937742e+08
Name: MME, dtype: float64

In [245]:
# fl shipment to Florida after 2010
fl_ship_fl2 = fl_ship_fl[fl_ship_fl['YEAR']> 2010]
fl_ship_fl2.groupby('STNAME')['MME'].mean()

STNAME
Florida    1.459275e+08
Name: MME, dtype: float64

In [246]:
# shipment to Florida by CTYNAME before 2010
fl_ship_fl1.groupby('CTYNAME')['MME'].mean()
fl_ship_fl1.max()

STNAME                      Florida
CTYNAME                  WASHINGTON
YEAR                           2010
POPULATION                  2506986
BUYER_COUNTY_x           WASHINGTON
BUYER_STATE_x                    FL
FIPS Code                     12133
State_x                     Florida
BUYER_STATE_y                    FL
BUYER_COUNTY_y           WASHINGTON
MME               3026736844.585425
State_y                     Florida
dtype: object

In [247]:
# shipment to Florida by CTYNAME after 2010
fl_ship_fl2.groupby('CTYNAME')['MME'].mean()
fl_ship_fl2.max()

STNAME                      Florida
CTYNAME                  WASHINGTON
YEAR                           2014
POPULATION                  2634056
BUYER_COUNTY_x           WASHINGTON
BUYER_STATE_x                    FL
FIPS Code                     12133
State_x                     Florida
BUYER_STATE_y                    FL
BUYER_COUNTY_y           WASHINGTON
MME               1533314549.951288
State_y                     Florida
dtype: object

### Washington--CO, AZ, NY

In [248]:
url = 'https://raw.githubusercontent.com/MIDS-at-Duke/pds-2022-yellow-team/main/20_intermediate_files/wa_ship_merge.csv?token=GHSAT0AAAAAABYIEB2PPDXKA4RIQCJA72N2Y4TWYLQ'
df_WA = pd.read_csv(url)
df_WA.head()

,BUYER_STATE,BUYER_COUNTY,YEAR,MME,FIPS Code,State,STNAME,CTYNAME,POPULATION
0,AZ,APACHE,2006,4.956969e+06,4001,Arizona,Arizona,APACHE,69066
1,AZ,APACHE,2007,5.611684e+06,4001,Arizona,Arizona,APACHE,69278
2,AZ,APACHE,2008,5.853244e+06,4001,Arizona,Arizona,APACHE,69520
3,AZ,APACHE,2009,7.344332e+06,4001,Arizona,Arizona,APACHE,70591
4,AZ,APACHE,2010,7.732743e+06,4001,Arizona,Arizona,APACHE,71828

In [249]:
df2 = df_WA.copy()
df2['BUYER_STATE']=df2['BUYER_STATE'].replace(['CO','AZ','NY'],'Comparison_State')
df2['BUYER_STATE'].value_counts()
round(df2.groupby('BUYER_STATE')['MME'].describe(),2)

,count,mean,std,min,25%,50%,75%,max
BUYER_STATE,,,,,,,,
Comparison_State,1219.0,73096665.97,1.851588e+08,242.16,5070708.75,16678279.11,55783699.52,2.114214e+09
WA,351.0,61484989.38,1.135400e+08,761058.52,7347821.67,20319301.58,51758630.42,6.469564e+08

In [250]:
# wa shipment to CO before 2012
wa_ship_co = df_WA[df_WA['STNAME'] == 'Colorado']
wa_ship_co1 = wa_ship_co[wa_ship_co['YEAR']<= 2012]
wa_ship_co1.groupby('STNAME')['MME'].mean()

STNAME
Colorado    2.544277e+07
Name: MME, dtype: float64

In [251]:
# wa shipment to CO after 2012
wa_ship_co2 = wa_ship_co[wa_ship_co['YEAR']> 2012]
wa_ship_co2.groupby('STNAME')['MME'].mean()

STNAME
Colorado    3.000596e+07
Name: MME, dtype: float64

In [252]:
# wa shipment to AZ before 2012
wa_ship_az = df_WA[df_WA['STNAME'] == 'Arizona']
wa_ship_az1 = wa_ship_az[wa_ship_az['YEAR']<= 2012]
wa_ship_az1.groupby('STNAME')['MME'].mean()

STNAME
Arizona    1.853882e+08
Name: MME, dtype: float64

In [253]:
# wa shipment to AZ after 2012
wa_ship_az2 = wa_ship_az[wa_ship_az['YEAR']> 2012]
wa_ship_az2.groupby('STNAME')['MME'].mean()

STNAME
Arizona    2.329883e+08
Name: MME, dtype: float64

In [254]:
# wa shipment to NY before 2012
wa_ship_ny = df_WA[df_WA['STNAME'] == 'New York']
wa_ship_ny1 = wa_ship_ny[wa_ship_ny['YEAR']<= 2012]
wa_ship_ny1.groupby('STNAME')['MME'].mean()

STNAME
New York    8.480298e+07
Name: MME, dtype: float64

In [255]:
# shipment to NY by CTYNAME before 2012
wa_ship_ny1.groupby('CTYNAME')['MME'].mean()
wa_ship_ny1.max()

BUYER_STATE                   NY
BUYER_COUNTY               YATES
YEAR                        2012
MME             767117238.708112
FIPS Code                  36123
State                   New York
STNAME                  New York
CTYNAME                    YATES
POPULATION               2568538
dtype: object

In [256]:
# wa shipment to NY after 2012
wa_ship_ny2 = wa_ship_ny[wa_ship_ny['YEAR']> 2012]
wa_ship_ny2.groupby('STNAME')['MME'].mean()

STNAME
New York    9.623149e+07
Name: MME, dtype: float64

In [257]:
# shipment to NY by CTYNAME after 2012
wa_ship_ny2.groupby('CTYNAME')['MME'].mean()
wa_ship_ny2.max()

BUYER_STATE                   NY
BUYER_COUNTY               YATES
YEAR                        2014
MME             625433764.025213
FIPS Code                  36123
State                   New York
STNAME                  New York
CTYNAME                    YATES
POPULATION               2601527
dtype: object

In [258]:
# wa shipment to WA before 2012
wa_ship_wa = df_WA[df_WA['STNAME'] == 'Washington']
wa_ship_wa1 = wa_ship_wa[wa_ship_wa['YEAR']<= 2012]
wa_ship_wa1.groupby('STNAME')['MME'].mean()

STNAME
Washington    6.116464e+07
Name: MME, dtype: float64

In [259]:
# wa shipment to WA after 2012
wa_ship_wa2 = wa_ship_wa[wa_ship_wa['YEAR']> 2012]
wa_ship_wa2.groupby('STNAME')['MME'].mean()

STNAME
Washington    6.260623e+07
Name: MME, dtype: float64

## TX - shipment by month

In [315]:
url = 'https://raw.githubusercontent.com/MIDS-at-Duke/pds-2022-yellow-team/main/20_intermediate_files/texas_shipment_cleaned.csv?token=GHSAT0AAAAAABYIEB2ODJLUMXBJHQWRDBFOY4T34JA'
df_tx = pd.read_csv(url)
df_tx.head()

  BUYER_STATE BUYER_COUNTY  YEAR  MONTH         MME
0          IL        ADAMS  2006      1  165410.055
1          IL        ADAMS  2006      2  816565.590
2          IL        ADAMS  2006      3  940374.650
3          IL        ADAMS  2006      4  877958.510
4          IL        ADAMS  2006      5  984764.605

In [316]:
df2 = df_tx.copy()
df2['BUYER_STATE']=df2['BUYER_STATE'].replace(['IL','OR','NY'],'Comparison_State')
df2['BUYER_STATE'].value_counts()
round(df2.groupby('BUYER_STATE')['MME'].describe(),2)

,count,mean,std,min,25%,50%,75%,max
BUYER_STATE,,,,,,,,
Comparison_State,21214.0,3837451.12,8730708.23,18.16,285781.36,971152.28,2690345.39,8.549806e+07
TX,24042.0,1945605.54,7160816.91,60.54,99853.25,310666.88,1179114.07,1.192512e+08

## Death

### Florida-LA,NV,CO

In [260]:
url = 'https://raw.githubusercontent.com/MIDS-at-Duke/pds-2022-yellow-team/main/20_intermediate_files/florida_death_cleaned.csv?token=GHSAT0AAAAAABYIEB2OUYVJKLRL6RKNRWACY4TWZ3A'
DE_fl = pd.read_csv(url)
DE_fl.head()

   YEAR    STNAME           CTYNAME  Death Rate (%)  POPULATION Indicator
0  2003  Colorado      Adams County        0.011088      378785   Control
1  2003  Colorado    Alamosa County        0.009527       15125   Control
2  2003  Colorado   Arapahoe County        0.008748      514406   Control
3  2003  Colorado  Archuleta County        0.009527       11167   Control
4  2003  Colorado       Baca County        0.009527        4106   Control

In [261]:
df3 = DE_fl.copy()
df3['STNAME']=df3['STNAME'].replace(['Louisiana','Nevada','Colorado'],'Comparison_State')
df3['STNAME'].value_counts()
round(df3.groupby('STNAME')['Death Rate (%)'].describe(),4)

,count,mean,std,min,25%,50%,75%,max
STNAME,,,,,,,,
Comparison_State,1885.0,0.0157,0.0049,0.0034,0.0127,0.0149,0.0190,0.0783
Florida,871.0,0.0146,0.0046,0.0038,0.0125,0.0146,0.0165,0.0408

In [262]:
# fl death in LA before 2010
DE_fl_la = DE_fl[DE_fl['STNAME'] == 'Louisiana']
DE_fl_la1 = DE_fl_la[DE_fl_la['YEAR']<= 2010]
DE_fl_la1.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Louisiana    0.016749
Name: Death Rate (%), dtype: float64

In [263]:
# death to LA by CTYNAME before 2010 top 3 county 
DE_fl_la1.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_fl_la2010 = DE_fl_la1[DE_fl_la1['YEAR'] <= 2010].sort_values(ascending=False,by='Death Rate (%)')
DE_fl_la2010.head(3)

,YEAR,STNAME,CTYNAME,Death Rate (%),POPULATION,Indicator
1746,2003,Louisiana,St. Bernard Parish,0.044122,65727,Control
1831,2005,Louisiana,Acadia Parish,0.039149,58750,Control
2066,2008,Louisiana,St. Bernard Parish,0.034511,37669,Control

In [264]:
# fl death in LA after 2010
DE_fl_la2 = DE_fl_la[DE_fl_la['YEAR']> 2010]    
DE_fl_la2.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Louisiana    0.016692
Name: Death Rate (%), dtype: float64

In [265]:
# death to LA by CTYNAME after 2010 top 3 county 
DE_fl_la2.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_fl_la_after_2010 = DE_fl_la2[DE_fl_la2['YEAR'] > 2010].sort_values(ascending=False,by='Death Rate (%)')
DE_fl_la_after_2010.head(3)

,YEAR,STNAME,CTYNAME,Death Rate (%),POPULATION,Indicator
2529,2015,Louisiana,Washington Parish,0.038822,46365,Control
2386,2013,Louisiana,St. Bernard Parish,0.034526,43446,Control
2502,2015,Louisiana,Livingston Parish,0.034256,137202,Control

In [266]:
# death to LA by CTYNAME after 2010 top 3 county
DE_fl_la2015 = DE_fl_la2[DE_fl_la2['YEAR'] > 2010].sort_values(ascending=False,by='Death Rate (%)')
DE_fl_la2015.head(3)

,YEAR,STNAME,CTYNAME,Death Rate (%),POPULATION,Indicator
2529,2015,Louisiana,Washington Parish,0.038822,46365,Control
2386,2013,Louisiana,St. Bernard Parish,0.034526,43446,Control
2502,2015,Louisiana,Livingston Parish,0.034256,137202,Control

In [267]:
# fl death in NV before 2010
DE_fl_nv = DE_fl[DE_fl['STNAME'] == 'Nevada']
DE_fl_nv1 = DE_fl_nv[DE_fl_nv['YEAR']<= 2010]
DE_fl_nv1.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Nevada    0.019717
Name: Death Rate (%), dtype: float64

In [268]:
# death to NV by CTYNAME before 2010 top 3 county 
DE_fl_nv1.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_fl_nv2010 = DE_fl_nv1[DE_fl_nv1['YEAR'] <= 2010].sort_values(ascending=False,by='Death Rate (%)')
DE_fl_nv2010.head(3)

      YEAR  STNAME         CTYNAME  Death Rate (%)  POPULATION Indicator
2665  2010  Nevada      Nye County        0.038770       43848   Control
2670  2010  Nevada     Carson City        0.025651       54983   Control
2662  2010  Nevada  Lincoln County        0.025651        5351   Control

In [269]:
# fl death in NV after 2010
DE_fl_nv = DE_fl[DE_fl['STNAME'] == 'Nevada']
DE_fl_nv2 = DE_fl_nv[DE_fl_nv['YEAR']> 2010]
DE_fl_nv2.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Nevada    0.023963
Name: Death Rate (%), dtype: float64

In [270]:
# death to NV by CTYNAME after 2010 top 3 county 
DE_fl_nv_after_2010 = DE_fl_nv2[DE_fl_nv2['YEAR'] >2010].sort_values(ascending=False,by='Death Rate (%)')
DE_fl_nv_after_2010.head(3)

      YEAR  STNAME          CTYNAME  Death Rate (%)  POPULATION Indicator
2755  2015  Nevada      Carson City        0.044320       54152   Control
2750  2015  Nevada       Nye County        0.034877       43008   Control
2745  2015  Nevada  Humboldt County        0.029728       17033   Control

In [271]:
# fl death in CO before 2010
DE_fl_co = DE_fl[DE_fl['STNAME'] == 'Colorado']
DE_fl_co1 = DE_fl_co[DE_fl_co['YEAR']<= 2010]
DE_fl_co1.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Colorado    0.011744
Name: Death Rate (%), dtype: float64

In [272]:
# death to NV by CTYNAME before 2010 top 3 county 
DE_fl_co1.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_fl_co2010 = DE_fl_co1[DE_fl_co1['YEAR'] <= 2010].sort_values(ascending=False,by='Death Rate (%)')
DE_fl_co2010.head(3)

     YEAR    STNAME        CTYNAME  Death Rate (%)  POPULATION Indicator
336  2008  Colorado  Denver County        0.028664      593086   Control
400  2009  Colorado  Denver County        0.026215      610345   Control
272  2007  Colorado  Denver County        0.025571      578789   Control

In [273]:
# fl death in CO after 2010
DE_fl_co = DE_fl[DE_fl['STNAME'] == 'Colorado']
DE_fl_co2 = DE_fl_co[DE_fl_co['YEAR']> 2010]
DE_fl_co2.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Colorado    0.015727
Name: Death Rate (%), dtype: float64

In [274]:
# death to NV by CTYNAME after 2010 top 3 county 
DE_fl_co_after_2010 = DE_fl_co2[DE_fl_co2['YEAR'] >2010].sort_values(ascending=False,by='Death Rate (%)')
DE_fl_co_after_2010.head(3)

     YEAR    STNAME            CTYNAME  Death Rate (%)  POPULATION Indicator
804  2015  Colorado  Las Animas County        0.078303       14048   Control
819  2015  Colorado      Pueblo County        0.026977      163101   Control
528  2011  Colorado      Denver County        0.026280      620250   Control

In [275]:
# fl death in fl before 2010
DE_fl_fl = DE_fl[DE_fl['STNAME'] == 'Florida']
DE_fl_fl1 = DE_fl_fl[DE_fl_fl['YEAR']<= 2010]
DE_fl_fl1.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Florida    0.014722
Name: Death Rate (%), dtype: float64

In [276]:
# death to fl by CTYNAME before 2010 top 3 county 
DE_fl_co1.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_fl_co_2010 = DE_fl_co1[DE_fl_co1['YEAR'] <= 2010].sort_values(ascending=False,by='Death Rate (%)')
DE_fl_co_2010.head(3)

     YEAR    STNAME        CTYNAME  Death Rate (%)  POPULATION Indicator
336  2008  Colorado  Denver County        0.028664      593086   Control
400  2009  Colorado  Denver County        0.026215      610345   Control
272  2007  Colorado  Denver County        0.025571      578789   Control

In [277]:
# fl death in fl after 2010
DE_fl_fl = DE_fl[DE_fl['STNAME'] == 'Florida']
DE_fl_fl2 = DE_fl_fl[DE_fl_fl['YEAR'] > 2010]
DE_fl_fl2.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Florida    0.014469
Name: Death Rate (%), dtype: float64

In [278]:
# death to fl by CTYNAME after 2010 top 3 county 
DE_fl_co2.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_fl_co_after_2010 = DE_fl_co2[DE_fl_co2['YEAR'] > 2010].sort_values(ascending=False,by='Death Rate (%)')
DE_fl_co_after_2010.head(3)

     YEAR    STNAME            CTYNAME  Death Rate (%)  POPULATION Indicator
804  2015  Colorado  Las Animas County        0.078303       14048   Control
819  2015  Colorado      Pueblo County        0.026977      163101   Control
528  2011  Colorado      Denver County        0.026280      620250   Control

### Washington--OR,OK,HI

In [279]:
url = 'https://raw.githubusercontent.com/MIDS-at-Duke/pds-2022-yellow-team/main/20_intermediate_files/washington_death_cleaned.csv?token=GHSAT0AAAAAABYIEB2PZANPNCDZX54OMEMUY4TW5AQ'
DE_wa = pd.read_csv(url)
DE_wa.head()

   YEAR  STNAME          CTYNAME  Death Rate (%)  POPULATION Indicator
0  2003  Hawaii    Hawaii County        0.007036      156340   Control
1  2003  Hawaii  Honolulu County        0.006982      888026   Control
2  2003  Hawaii   Kalawao County        0.007009         129   Control
3  2003  Hawaii     Kauai County        0.007009       60061   Control
4  2003  Hawaii      Maui County        0.007009      134742   Control

In [280]:
df4 = DE_wa.copy()
df4['STNAME']=df4['STNAME'].replace(['Oregon','Oklahoma','Hawaii'],'Comparison_State')
df4['STNAME'].value_counts()
round(df4.groupby('STNAME')['Death Rate (%)'].describe(),4)

,count,mean,std,min,25%,50%,75%,max
STNAME,,,,,,,,
Comparison_State,1534.0,0.0160,0.0056,0.0034,0.0114,0.0155,0.0199,0.0401
Washington,507.0,0.0134,0.0034,0.0043,0.0120,0.0137,0.0143,0.0314

In [281]:
# WA death in OR before 2012
DE_wa_or = DE_wa[DE_wa['STNAME'] == 'Oregon']
DE_wa_or1 = DE_wa_or[DE_wa_or['YEAR']<= 2012]
DE_wa_or1.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Oregon    0.010542
Name: Death Rate (%), dtype: float64

In [282]:
# death to OR by CTYNAME before 2012 top 3 county 
DE_wa_or1.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_wa_or_2012 = DE_wa_or1[DE_wa_or1['YEAR'] <= 2012].sort_values(ascending=False,by='Death Rate (%)')
DE_wa_or_2012.head(3)

      YEAR  STNAME           CTYNAME  Death Rate (%)  POPULATION Indicator
1357  2011  Oregon    Clatsop County        0.029537       37241   Control
1235  2007  Oregon  Multnomah County        0.023384      697048   Control
1188  2006  Oregon    Jackson County        0.021411      196165   Control

In [283]:
# WA death in OR after 2012
DE_wa_or2 = DE_wa_or[DE_wa_or['YEAR']> 2012]
DE_wa_or2.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Oregon    0.01136
Name: Death Rate (%), dtype: float64

In [284]:
# death to OR by CTYNAME after 2012 top 3 county 
DE_wa_or1.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_wa_or_after_2012 = DE_wa_or2[DE_wa_or2['YEAR'] > 2012].sort_values(ascending=False,by='Death Rate (%)')
DE_wa_or_after_2012.head(3)

      YEAR  STNAME         CTYNAME  Death Rate (%)  POPULATION Indicator
1482  2014  Oregon  Lincoln County        0.025872       46383   Control
1483  2014  Oregon     Linn County        0.019312      119095   Control
1481  2014  Oregon     Lane County        0.016189      358273   Control

In [285]:
# WA death in OK before 2012
DE_wa_ok = DE_wa[DE_wa['STNAME'] == 'Oklahoma']
DE_wa_ok1 = DE_wa_ok[DE_wa_ok['YEAR']<= 2012]
DE_wa_ok1.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Oklahoma    0.018269
Name: Death Rate (%), dtype: float64

In [286]:
# death to OK by CTYNAME before 2012 top 3 county 
DE_wa_ok1.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_wa_ok_2012 = DE_wa_ok1[DE_wa_ok1['YEAR'] <= 2012].sort_values(ascending=False,by='Death Rate (%)')
DE_wa_ok_2012.head(3)

     YEAR    STNAME          CTYNAME  Death Rate (%)  POPULATION Indicator
588  2009  Oklahoma  Pontotoc County        0.037411       37422   Control
742  2011  Oklahoma  Pontotoc County        0.037085       37751   Control
594  2009  Oklahoma  Sequoyah County        0.036203       41433   Control

In [287]:
# WA death in OR after 2012
DE_wa_ok2 = DE_wa_or[DE_wa_or['YEAR']>2012]
DE_wa_ok2.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Oregon    0.01136
Name: Death Rate (%), dtype: float64

In [288]:
# death to OK by CTYNAME after 2012 top 3 county 
DE_wa_ok2.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_wa_ok_after_2012 = DE_wa_ok2[DE_wa_ok2['YEAR'] > 2012].sort_values(ascending=False,by='Death Rate (%)')
DE_wa_ok_after_2012.head(3)

      YEAR  STNAME         CTYNAME  Death Rate (%)  POPULATION Indicator
1482  2014  Oregon  Lincoln County        0.025872       46383   Control
1483  2014  Oregon     Linn County        0.019312      119095   Control
1481  2014  Oregon     Lane County        0.016189      358273   Control

In [289]:
# WA death in Hi before 2012
DE_wa_hi = DE_wa[DE_wa['STNAME'] == 'Hawaii']
DE_wa_hi1 = DE_wa_hi[DE_wa_hi['YEAR']<= 2012]
DE_wa_hi1.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Hawaii    0.00948
Name: Death Rate (%), dtype: float64

In [290]:
# death to Hi by CTYNAME before 2012 top 3 county 
DE_wa_hi1.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_wa_hi_2012 = DE_wa_hi1[DE_wa_hi1['YEAR'] <= 2012].sort_values(ascending=False,by='Death Rate (%)')
DE_wa_hi_2012.head(3)

    YEAR  STNAME        CTYNAME  Death Rate (%)  POPULATION Indicator
44  2011  Hawaii    Maui County        0.020386      156967   Control
30  2009  Hawaii  Hawaii County        0.015745      177835   Control
25  2008  Hawaii  Hawaii County        0.013039      176399   Control

In [291]:
# WA death in Hi after 2012
DE_wa_hi2 = DE_wa_hi[DE_wa_hi['YEAR']>2012]
DE_wa_hi2.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Hawaii    0.008865
Name: Death Rate (%), dtype: float64

In [292]:
# death to Hi by CTYNAME after 2012 top 3 county 
DE_wa_hi2.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_wa_hi_after_2012 = DE_wa_hi2[DE_wa_hi2['YEAR'] > 2012].sort_values(ascending=False,by='Death Rate (%)')
DE_wa_hi_after_2012.head(3)

    YEAR  STNAME          CTYNAME  Death Rate (%)  POPULATION Indicator
61  2015  Hawaii  Honolulu County        0.011999      991755   Control
59  2014  Hawaii      Maui County        0.011035      163116   Control
51  2013  Hawaii  Honolulu County        0.010441      986494   Control

In [293]:
# WA death in WA before 2012
DE_wa_wa = DE_wa[DE_wa['STNAME'] == 'Washington']
DE_wa_wa1 = DE_wa_wa[DE_wa_wa['YEAR']<= 2012]
DE_wa_wa1.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Washington    0.013275
Name: Death Rate (%), dtype: float64

In [294]:
# death to WA by CTYNAME before 2012 top 3 county 
DE_wa_wa1.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_wa_wa_2012 = DE_wa_wa1[DE_wa_wa1['YEAR'] <= 2012].sort_values(ascending=False,by='Death Rate (%)')
DE_wa_wa_2012.head(3)

      YEAR      STNAME         CTYNAME  Death Rate (%)  POPULATION  Indicator
1683  2006  Washington  Stevens County        0.031407       41392  Treatment
1760  2008  Washington  Spokane County        0.027249      462408  Treatment
1694  2007  Washington  Clallam County        0.027038       70272  Treatment

In [295]:
# WA death in WA after 2012
DE_wa_wa2 = DE_wa_wa[DE_wa_wa['YEAR']> 2012]
DE_wa_wa2.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Washington    0.013734
Name: Death Rate (%), dtype: float64

In [296]:
# death to WA by CTYNAME after 2012 top 3 county 
DE_wa_wa_after_2012 = DE_wa_wa2[DE_wa_wa2['YEAR'] >2012].sort_values(ascending=False,by='Death Rate (%)')
DE_wa_wa_after_2012.head(3)

,YEAR,STNAME,CTYNAME,Death Rate (%),POPULATION,Indicator
1998,2014,Washington,Walla Walla County,0.021831,59548,Treatment
1976,2014,Washington,Grays Harbor County,0.021188,70796,Treatment
2015,2015,Washington,Grays Harbor County,0.021119,71027,Treatment

### Texas--WI,NY,OR

In [297]:
url = 'https://raw.githubusercontent.com/MIDS-at-Duke/pds-2022-yellow-team/main/20_intermediate_files/texas_death_cleaned.csv?token=GHSAT0AAAAAABYIEB2PMRJS2EW6CMRYOGESY4TW7YA'
DE_tx = pd.read_csv(url)
DE_tx.head()

   YEAR    STNAME             CTYNAME  Death Rate (%)  POPULATION Indicator
0  2003  New York       Albany County        0.005506      298491   Control
1  2003  New York     Allegany County        0.005506       50220   Control
2  2003  New York        Bronx County        0.009677     1353712   Control
3  2003  New York       Broome County        0.005506      198364   Control
4  2003  New York  Cattaraugus County        0.005506       82968   Control

In [298]:
df5 = DE_tx.copy()
df5['STNAME']=df5['STNAME'].replace(['Wisconsin','New York','Oregon'],'Comparison_State')
df5['STNAME'].value_counts()
round(df5.groupby('STNAME')['Death Rate (%)'].describe(),4)

,count,mean,std,min,25%,50%,75%,max
STNAME,,,,,,,,
Comparison_State,2210.0,0.0106,0.0032,0.0008,0.0084,0.0108,0.0129,0.0376
Texas,3302.0,0.0102,0.0022,0.0015,0.0093,0.0099,0.0107,0.0416

In [299]:
# Tx death in WI before 2007
DE_tx_wi = DE_tx[DE_tx['STNAME'] == 'Wisconsin']
DE_tx_wi1 = DE_tx_wi[DE_tx_wi['YEAR']<= 2007]
DE_tx_wi1.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Wisconsin    0.009522
Name: Death Rate (%), dtype: float64

In [300]:
# death to WI by CTYNAME before 2007 top 3 county 
DE_tx_wi.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_tx_wi_2007 = DE_tx_wi1[DE_tx_wi1['YEAR'] <= 2007].sort_values(ascending=False,by='Death Rate (%)')
DE_tx_wi_2007.head(3)

      YEAR     STNAME           CTYNAME  Death Rate (%)  POPULATION Indicator
4832  2006  Wisconsin  Milwaukee County        0.019950      952374   Control
4904  2007  Wisconsin  Milwaukee County        0.019429      952185   Control
4760  2005  Wisconsin  Milwaukee County        0.018502      951265   Control

In [301]:
# Tx death in WI after 2007
DE_tx_wi2 = DE_tx_wi[DE_tx_wi['YEAR']> 2007]
DE_tx_wi2.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Wisconsin    0.012712
Name: Death Rate (%), dtype: float64

In [302]:
# death to WI by CTYNAME after 2007 top 3 county 
DE_tx_wi_after_2007 = DE_tx_wi2[DE_tx_wi2['YEAR'] > 2007].sort_values(ascending=False,by='Death Rate (%)')
DE_tx_wi_after_2007.head(3)

      YEAR     STNAME           CTYNAME  Death Rate (%)  POPULATION Indicator
5480  2015  Wisconsin  Milwaukee County        0.026705      958606   Control
5408  2014  Wisconsin  Milwaukee County        0.025140      958639   Control
5336  2013  Wisconsin  Milwaukee County        0.023602      957557   Control

In [303]:
# Tx death in NY before 2007
DE_tx_ny= DE_tx[DE_tx['STNAME'] == 'New York']
DE_tx_ny1 = DE_tx_ny[DE_tx_ny['YEAR']<= 2007]
DE_tx_ny1.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
New York    0.007168
Name: Death Rate (%), dtype: float64

In [304]:
# death to NY by CTYNAME before 2007 top 3 county 
DE_tx_ny.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_tx_ny_2007 = DE_tx_ny1[DE_tx_ny1['YEAR'] <= 2007].sort_values(ascending=False,by='Death Rate (%)')
DE_tx_ny_2007.head(3)

     YEAR    STNAME          CTYNAME  Death Rate (%)  POPULATION Indicator
238  2006  New York  Sullivan County        0.018463       75828   Control
188  2006  New York     Bronx County        0.013636     1371353   Control
300  2007  New York  Sullivan County        0.013088       76403   Control

In [305]:
# Tx death in NY after 2007
DE_tx_ny2 = DE_tx_ny[DE_tx_ny['YEAR']> 2007]
DE_tx_ny2.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
New York    0.010906
Name: Death Rate (%), dtype: float64

In [306]:
# death to NY by CTYNAME after 2007 top 3 county 
DE_tx_ny_after_2007 = DE_tx_ny2[DE_tx_ny2['YEAR'] > 2007].sort_values(ascending=False,by='Death Rate (%)')
DE_tx_ny_after_2007.head(3)

     YEAR    STNAME          CTYNAME  Death Rate (%)  POPULATION Indicator
548  2011  New York  Sullivan County        0.037633       77061   Control
758  2015  New York      Erie County        0.029429      920858   Control
735  2014  New York     Tioga County        0.026076       49855   Control

In [307]:
# Tx death in Or before 2007
DE_tx_or= DE_tx[DE_tx['STNAME'] == 'Oregon']
DE_tx_or1 = DE_tx_or[DE_tx_or['YEAR']<= 2007]
DE_tx_or1.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Oregon    0.009841
Name: Death Rate (%), dtype: float64

In [308]:
# death to Or by CTYNAME before 2007 top 3 county 
DE_tx_or.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_tx_or_2007 = DE_tx_or1[DE_tx_or1['YEAR'] <= 2007].sort_values(ascending=False,by='Death Rate (%)')
DE_tx_or_2007.head(3)

     YEAR  STNAME           CTYNAME  Death Rate (%)  POPULATION Indicator
975  2007  Oregon  Multnomah County        0.023384      697048   Control
928  2006  Oregon    Jackson County        0.021411      196165   Control
939  2006  Oregon  Multnomah County        0.019041      682732   Control

In [309]:
# Tx death in Or after 2007
DE_tx_or2 = DE_tx_or[DE_tx_or['YEAR']> 2007]
DE_tx_or2.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Oregon    0.011287
Name: Death Rate (%), dtype: float64

In [310]:
# death to Or by CTYNAME after 2007 top 3 county 
DE_tx_or_after_2007 = DE_tx_or2[DE_tx_or2['YEAR'] > 2007].sort_values(ascending=False,by='Death Rate (%)')
DE_tx_or_after_2007.head(3)

      YEAR  STNAME         CTYNAME  Death Rate (%)  POPULATION Indicator
1097  2011  Oregon  Clatsop County        0.029537       37241   Control
1222  2014  Oregon  Lincoln County        0.025872       46383   Control
1041  2009  Oregon     Lane County        0.021361      351109   Control

In [311]:
# Tx death in Tx before 2007
DE_tx_tx= DE_tx[DE_tx['STNAME'] == 'Texas']
DE_tx_tx1 = DE_tx_tx[DE_tx_tx['YEAR']<= 2007]
DE_tx_tx1.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Texas    0.009794
Name: Death Rate (%), dtype: float64

In [312]:
# death to Tx by CTYNAME before 2007 top 3 county 
DE_tx_tx.groupby('CTYNAME')['Death Rate (%)'].mean()
DE_tx_tx_2007 = DE_tx_tx1[DE_tx_tx1['YEAR'] <= 2007].sort_values(ascending=False,by='Death Rate (%)')
DE_tx_tx_2007.head(3)

      YEAR STNAME         CTYNAME  Death Rate (%)  POPULATION  Indicator
2216  2006  Texas   Orange County        0.041554       81822  Treatment
2039  2006  Texas  Aransas County        0.041004       24388  Treatment
2222  2006  Texas     Polk County        0.028206       46089  Treatment

In [313]:
# Tx death in Tx after 2007
DE_tx_tx2 = DE_tx_tx[DE_tx_tx['YEAR']> 2007]
DE_tx_tx2.groupby('STNAME')['Death Rate (%)'].mean()

STNAME
Texas    0.010422
Name: Death Rate (%), dtype: float64

In [314]:
# death to Tx by CTYNAME after 2007 top 3 county 
DE_tx_or_after_2007 = DE_tx_tx2[DE_tx_tx2['YEAR'] > 2007].sort_values(ascending=False,by='Death Rate (%)')
DE_tx_or_after_2007.head(3)

      YEAR STNAME         CTYNAME  Death Rate (%)  POPULATION  Indicator
2978  2009  Texas   Orange County        0.035445       81816  Treatment
3232  2010  Texas   Orange County        0.030482       82015  Treatment
3163  2010  Texas  Hopkins County        0.028400       35211  Treatment